1. Manually creating dataframes
2. Reading data from external file
3. peripheral summary of the data
4. Subsetting on the basis of rownumber,colnumber
5. subsetting on the basis of condition
6. subsetting on the basis of column names

In [1]:
import pandas as pd
import numpy as np

In [18]:
age=np.random.randint(low=16,high=80,size=[20,])
city=np.random.choice(['Mumbai','Jorhat','Delhi','Duliajan'],20)
default =np.random.choice([0,1],20)

using zip to convert them into a single list of tuples

In [6]:
a=[1,2,3]
b=[8,9,0]
c=['a','b','c']
list(zip(a,b,c))

[(1, 8, 'a'), (2, 9, 'b'), (3, 0, 'c')]

In [8]:
#one way to check the data. Not recommended coz hard to read
mydata=list(zip(age,city,default)) #we get rows of data
mydata

[(49, 'Jorhat', 0),
 (36, 'Jorhat', 1),
 (24, 'Duliajan', 0),
 (52, 'Delhi', 1),
 (25, 'Mumbai', 1),
 (37, 'Delhi', 1),
 (63, 'Duliajan', 0),
 (70, 'Duliajan', 1),
 (76, 'Duliajan', 0),
 (67, 'Mumbai', 1),
 (37, 'Duliajan', 0),
 (75, 'Delhi', 0),
 (74, 'Duliajan', 1),
 (37, 'Delhi', 0),
 (70, 'Mumbai', 1),
 (43, 'Mumbai', 0),
 (45, 'Jorhat', 0),
 (23, 'Duliajan', 1),
 (34, 'Duliajan', 0),
 (57, 'Delhi', 1)]

In [20]:
#Another way of looking into the data
df=pd.DataFrame(data=mydata,columns=['age','city','default'])
df

    age      city  default
0    49    Jorhat        0
1    36    Jorhat        1
2    24  Duliajan        0
3    52     Delhi        1
4    25    Mumbai        1
5    37     Delhi        1
6    63  Duliajan        0
7    70  Duliajan        1
8    76  Duliajan        0
9    67    Mumbai        1
10   37  Duliajan        0
11   75     Delhi        0
12   74  Duliajan        1
13   37     Delhi        0
14   70    Mumbai        1
15   43    Mumbai        0
16   45    Jorhat        0
17   23  Duliajan        1
18   34  Duliajan        0
19   57     Delhi        1

In [21]:
#clearer way to give columns names is to give by a dictionary
df=pd.DataFrame({'age':age,'city':city,'default':default})
df

    age      city  default
0    16     Delhi        0
1    19     Delhi        1
2    56    Jorhat        1
3    47    Mumbai        1
4    60     Delhi        0
5    54     Delhi        0
6    59  Duliajan        1
7    54    Jorhat        1
8    16    Jorhat        1
9    44    Mumbai        0
10   60    Mumbai        0
11   62    Mumbai        1
12   51     Delhi        0
13   60    Jorhat        0
14   23     Delhi        0
15   77    Mumbai        0
16   68  Duliajan        0
17   25  Duliajan        0
18   72  Duliajan        1
19   50    Mumbai        1

Now we look at how to read fata from files in the system